# Taps
tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'svn' # Needed to install fonts

# Development
brew 'imagemagick'
brew 'yarn'

# Apps
cask '1password'
brew '1password-cli'
cask 'caffeine'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'httpie'
cask 'imageoptim'
cask 'loom'
cask 'pastebot'
cask 'reflex'
cask 'screen-studio'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'transmit'
cask 'visual-studio-code'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Things', id: 904280696
