# Taps
tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'svn' # Needed to install fonts
brew 'caddy'
brew 'mysql-client'
brew 'pandoc'

# Development
brew 'imagemagick'
brew 'yarn'

# Apps
cask '1password'
brew '1password-cli'
cask 'caffeine'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'httpie'
cask 'imageoptim'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'cursor'
cask 'deskpad'
cask 'hyprnote'
cask 'jordanbaird-ice'
cask 'keycastr'
cask 'raycast'
cask 'stats'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Things', id: 904280696
mas 'Bitwarden', id: 1352778147
mas 'Drafts', id: 1435957248
mas 'Transmit', id: 1436522307
mas 'Sequel Ace', id: 1518036000